{
	"app": "com.nintendo.zaba",
	"languages": [
		{"country": "AU", "lang": "en"},
		{"country": "CA", "lang": "en"},
		{"country": "IN", "lang": "en"},
		{"country": "IR", "lang": "en"},
		{"country": "NZ", "lang": "en"},
		{"country": "SG", "lang": "en"},
		{"country": "GB", "lang": "en"},
		{"country": "US", "lang": "en"},
		{"country": "BE", "lang": "fr"},
		{"country": "CA", "lang": "fr"},
		{"country": "FR", "lang": "fr"},
		{"country": "CH", "lang": "fr"},
		{"country": "ES", "lang": "es"},
		{"country": "MX", "lang": "es"},
		
		{"country": "BR", "lang": "pt"},
		{"country": "PT", "lang": "pt"},
		{"country": "jp", "lang": "ja"},
		{"country": "KR", "lang": "ko"},
		{"country": "TW", "lang": "zh"},
		{"country": "DE", "lang": "de"},
		{"country": "AT", "lang": "de"},
		{"country": "CH", "lang": "de"},
		{"country": "DE", "lang": "nl"},
		{"country": "NL", "lang": "nl"},


		{"country": "IT", "lang": "it"},
		{"country": "NO", "lang": "no"},
		{"country": "SE", "lang": "sv"}
	],
	"n_search_result": 30,
	"feh_release_date": "2017-02-02 1:00AM",
	"export_path": "./resources/export",
	"database": {
		"ara": {
			"path": "/api/resources/database/ara.db"
		}
	},
	"dataframe": {
		"reviews": ["userName", "content", "score", "thumbsUpCount", "reviewCreatedVersion", "at", "language"]
	},
	"mockSearch": [
		{
			"icon": "https://play-lh.googleusercontent.com/5IR5tmAD35Sqfi-tDrFmb-mk9wronJDZm1w3h8xtFeK1rDX46Cyt0nauwUmUexSU9uM",
			"id": "com.nintendo.znca",
			"title": "Nintendo Switch Online"
		},
		{
			"icon": "https://play-lh.googleusercontent.com/Nhdcc77MHYfXR9LoVhhkpnKbhwpZpCLKfl8dUwVhyqgflBQ5ROBtLsn_2fIongMYeoo6",
			"id": "com.nintendo.zaka",
			"title": "Mario Kart Tour"
		},
		{
			"icon": "https://play-lh.googleusercontent.com/5LIMaa7WTNy34bzdFhBETa2MRj7mFJZWb8gCn_uyxQkUvFx_uOFCeQjcK16c6WpBA3E",
			"id": "com.nintendo.zara",
			"title": "Super Mario Run"
		},
		{
			"icon": "https://play-lh.googleusercontent.com/iLWZvlyKSyPbZEIOrbL3vIz2KamA2nue1NDZzlnMK00_x1bOnD-f-BqdkxVJP4xqlFTQ",
			"id": "com.nintendo.zaca",
			"title": "Animal Crossing: Pocket Camp"
		},
		{
			"icon": "https://play-lh.googleusercontent.com/x0KXDvnLHNcgUbA2Pwe2Id8YBNC97WM-057Qg-b-6kSbrd2ymBwC37R9cg081QY5ymQ",
			"id": "com.nintendo.zaba",
			"title": "Fire Emblem Heroes"
		},
		{
			"icon": "https://play-lh.googleusercontent.com/dpRR2-sdAAdqwco3Lx7C__BZupUNR0I_sz-F1UtIQCk1EEjWcyfi9XJX9UzWg0ieFCY",
			"id": "cz.gemsi.switchbuddy",
			"title": "SwitchBuddy: Switch Companion"
		},
		{
			"icon": "https://play-lh.googleusercontent.com/zi6QgTtIiAnGqQMizfoj2LnE85kzHyZlgTruSzJ7Zw_79NAmB3fhxuDegwxby7P0yw",
			"id": "com.scee.psxandroid",
			"title": "PlayStation App"
		},
		{
			"icon": "https://play-lh.googleusercontent.com/hihXCV-0wxOXB5N7uBREaJeCVK0BDjNEBtKwNAncftZMflpEvasiKXn7vCKxu9qGpvk",
			"id": "com.microsoft.xboxone.smartglass",
			"title": "Xbox"
		},
		{
			"icon": "https://play-lh.googleusercontent.com/pLnno-Kti8gAEUfTTg_4StfrqyZ5Uj1uL-TfqhPsAjTQtNplljjJNgXImoRFtt8XLRw",
			"id": "jp.pokemon.pokemonunite",
			"title": "Pokémon UNITE"
		},
		{
			"icon": "https://play-lh.googleusercontent.com/xoGGYH2LgLibLDBoxMg-ZE16b-RNfITw_OgXBWRAPin2FZY4FGB9QKBYApR-0rSCkQ",
			"id": "com.disney.disneyplus",
			"title": "Disney+"
		},
		{
			"icon": "https://play-lh.googleusercontent.com/wpRQkfqbkPztp1US6HDr8E41We8GyY-B4CG1PMmWI3WKDk9OeYh4ehXwKIfZB7dm-sc",
			"id": "com.google.android.play.games",
			"title": "Google Play Games"
		},
		{
			"icon": "https://play-lh.googleusercontent.com/mEQTKXkEJ7QwSCmec-cIe9b-GlAMCsG9efBAQV6yUDN6DZVtEuM25A4zfMi47KDUej8",
			"id": "jp.pokemon.pokemonhome",
			"title": "Pokémon HOME"
		},
		{
			"icon": "https://play-lh.googleusercontent.com/rryvrQRLNdQAsypjB4_wHlwu_GY5C_TRIT6mMPOJ70b4gTiaA2sgCIHCMfDj9gDqyg",
			"id": "jp.pokemon.pokemonsleep",
			"title": "Pokémon Sleep"
		},
		{
			"icon": "https://play-lh.googleusercontent.com/_WgZ0tnNL_qdq118_9sK631uyYBF0F-7H5wC7hPJyYHAsHRuQ-cZ-kQuAzTyPdTULw",
			"id": "com.lego.supermario",
			"title": "LEGO® Super Mario™"
		},
		{
			"icon": "https://play-lh.googleusercontent.com/HZ16nsxrSsoJoZx0JDJjpmRN2KC0eZRSTyS2O-Lgjw7BgjTU6W8uDSYNj1IMlbqmtQ",
			"id": "com.nianticlabs.pokemongo",
			"title": "Pokémon GO"
		},
		{
			"icon": "https://play-lh.googleusercontent.com/QLQzL-MXtxKEDlbhrQCDw-REiDsA9glUH4m16syfar_KVLRXlzOhN7tmAceiPerv4Jg",
			"id": "tv.twitch.android.app",
			"title": "Twitch: Live Game Streaming"
		},
		{
			"icon": "https://play-lh.googleusercontent.com/zS5PLmUQ-52nkQZdrDDmue4eMrso8x9GiV3kCTbyx5Ol4olXASU7PoWBAuNGBSeQNxY",
			"id": "com.sega.sonic1px",
			"title": "Sonic the Hedgehog™ Classic"
		},
		{
			"icon": "https://play-lh.googleusercontent.com/HJ-p-tyLANTanzg7XkQorjZ499g9uE9TYB-sFzLTu1_ACNAIkAUcI8C1DZzOSWBUyw",
			"id": "com.ea.gp.fifamobile",
			"title": "EA SPORTS FC™ MOBILE 24 SOCCER"
		},
		{
			"icon": "https://play-lh.googleusercontent.com/IEfDtMttybHdnlOTB8MPCC0E3WNLpB6YR3xs4lsYvkamZd58F0HQMtMSIWS9kZ5Alg",
			"id": "com.gamepass",
			"title": "Xbox Game Pass"
		},
		{
			"icon": "https://play-lh.googleusercontent.com/MT8c8zOEymG9KNjrQD6K0bXGIT1KKdF7UiaA9-XeLbO9Yi_clvI6JNkG62mUfWuirvsi",
			"id": "com.nintendo.znma",
			"title": "Nintendo Switch Parental Cont…"
		}
	],
	"mockDetail": {
		"adSupported": false,
		"appId": "com.nintendo.zaba",
		"categories": [
			{
				"id": "GAME_ACTION",
				"name": "Action"
			},
			{
				"id": null,
				"name": "Platformer"
			},
			{
				"id": "GAME_CASUAL",
				"name": "Casual"
			},
			{
				"id": null,
				"name": "Single player"
			},
			{
				"id": null,
				"name": "Stylized"
			},
			{
				"id": null,
				"name": "Cartoon"
			},
			{
				"id": "GAME_ROLE_PLAYING",
				"name": "Role Playing"
			},
			{
				"id": null,
				"name": "Tactical"
			},
			{
				"id": null,
				"name": "Multiplayer"
			},
			{
				"id": null,
				"name": "Competitive multiplayer"
			},
			{
				"id": null,
				"name": "Single player"
			},
			{
				"id": null,
				"name": "Stylized"
			},
			{
				"id": null,
				"name": "Anime"
			}
		],
		"comments": [
			"It's a decent mobile game all things considered. I've been playing on and off since launch and the powercreep feels really bad lately. They also still haven't put the basic function of repeating a map on auto battle as a standard feature, instead leaving it behind the pay wall as the only impactful incentive to stay subscribed consistently. That said, most new units are only about as strong as the ones I put all of my work into and my core team hasn't changed for years. Fun on the go at least.",
			"As a casual player I had a lot of fun with this. Screen broke on my old phone, which apparently never synced my account to Nintendo (which I thought was a required thing?) so I lost all of my progress, but the gameplay is good and can be a quick way to pass time. Lots of variety and builds for your favorite characters. Lots of free summons, no real need to buy anything. That being said I'm not downloading again - lost all my progress and characters. :( Word to the wise - sync your account!",
			"At its core, this is a pretty fun light strategy game, featuring grid-based fantasy combat - melee, archers, spells, and the like. If you're a fan of the Fire Emblem franchise, this is a fairly fun way to get your strategy fix on the go. However, the recent addition of the FEH Monthly Pass drags the experience down substantially. The pass itself isn't necessarily a terrible thing (depending on what *you* think it's worth), but there is a TERRIBLY unsubtle pressure to start paying $10 a month for a handful of added features. Putting that advertisement at the top of the shop menu, coupled with an announcement or two when they released it, would have been fine. They'd have the knowledge out there, and it would be easy enough to decide on. But as it is, you will be reminded that the monthly pass exists *just by completing quests* that are, by default, part of the quest tally on the castle screen - and that you can't redeem unless you start paying that $10/month subscription. That kind of intrusive \"advertising\" damages the experience, and for me, damages it badly enough that I may yet uproot FEH from my phone.",
			"The gameplay, events, art, original tracks, and voice acting is all very good. However, the rest of the game is not pretty. The premium currency is scarce and buying it doesn't even give a lot. New units are regularly added that outperform nearly anything else. And 95% of the units of this game are acquired through the predatory gacha (luck of the draw) system. On top of that, a premium subscription was added that is almost $120 a year. Overall, my experience was a lukewarm one.",
			"I like this game, but it's definitely not perfect. Let's start with the cons: massive powercreep issues with some of the newer units, and the game gets really repetitive sometimes. As for the pros, there's unique artwork for each unit and all of the music is great, some of the side modes (Tempest Trials & Forging Bonds specifically) provide some really fun character interactions, and currency is surprisingly easy to earn, especially with multiple difficulties for all story mode missions!",
			"Fun game overall. The main issue is the monetization and how easily power creep changes everything. However, besides a select few game modes, the game is mostly single player. It's great for playing when you're on your way to work or during lunch break. Overall, is a great game for casual play; not so much for wailing or competitive game because of the gacha system.",
			"I initially started the game as something to do to pass the time. With the release of the, \"Feh Pass,\" subscription service, however, I no longer feel as though it is right to support the business model this game is moving towards. While I do not object to a subscription model in principle, what I do object to is locking basic functionality and features that affect gameplay for other users behind payments. The, \"Feh Pass,\" as is, actively punishes players that do not purchase it.",
			"Nicely simplified installment of the long running franchise. Loads to do - so many characters and modes, as well as limited time events, prevent this from growing stale. Graphics are nice, though the animations are limited. Each character performs a motion that injures the other player, but doesn't always connect with them, Pokemon style. Probably a way to keep the file size down. Overall a great game that can be played equally well in a several hour marathon session or a few minutes.",
			"If you're a fan of the Fire Emblem series, this game does a fairly good job of condensing the classic tactical gameplay into a mobile format, utilizing small battle fields, less units, and a complete lack of combat RNG (Meaning no misses, critical hits, etc), while retaining a high level of customization via skill inheritance. However, it suffers rather heavily from an extremely stale event cycle with 90% of the modes being an extremely small twist on the standard \"Kill every enemy on the map\" formula, which is not helped by the AI being dumb as dirt; only posing much of a threat when they're given extremely broken stat/skill spreads either in the Abyssal difficulty maps or in PvP where heavy spenders regularly can be seen flexing their creations. It also has some very basic functions like looping autobattle locked behind its premium mode in the FEH pass. Overall, it's a decent game, but not one I'd look to if you want a deep tactical experience or something to hold your interest for long stretches of time.",
			"This game evolved from a fun anthology of Fire Emblem history, to an aggressive pay-to-win game that now constantly tries to shove a $9.49 monthly subscription at you. It is now impossible to play the game without a constant reminder of what you CAN'T get without it. If you haven't played this game for a couple years, don't start now. You'll be annoyed at how you can't progress to compete with long-time players and have the Pass dangled as the fix (it isn't, it won't change your disadvantage).",
			"After playing for over two years, it's hard to tell who Heroes should be recommended to: The game contains many spoilers from the main series, but they aren't introduced very well or explored much further here. It's not ideal for newer fans OR veterans of the series. The gameplay's okay enough, but the powercreep rate has definitely sped up, the demoted content remains very limited and specific, and the excessive menus are clunky and awkward. At the very least, I'd say the game had potential.",
			"This game had me playing for a whole year. Love the art, voice acting, and the constant flow of characters. Even F2P players can rack up a steady supply of orbs and have an amazing team. Though the updates and new modes can only do so much to stall the repetitiveness of the game. In the end, it has kept me playing for a long time and that deserves 5 stars.",
			"Alright gacha game, better than most. Major issues for me are the fact that the story seems rather uninteresting to me, so I really feel like I'm just kind of rushing through things because I stopped caring about the story halfway through. My other issue is the lack of separation of language settings for voiceover and menus. The English VAs did a fine job, but it's rather off-putting to me. I have very limited understanding of Japanese to navigate the more complex menus in the Japanese ver.",
			"Honestly, the game is a much more simplified strategy game than your traditional Fire Emblem title, but it can be fun. And it can also be very addicting. But now they've brought in a battle pass, which was a very bad call for a game like this. And they try to tempt you to get the pass by awarding you things you COULD get if you get the pass now. But honestly, the thing that turned me off was the summoning. It's just not rewarding, and there are better games worth my time.",
			"Hollow shell of what it once was. Used to not be 100% pay to win, it was fairly high pay to win before, but you could also save up the in game currency to enjoy. With the addition to Feh pass and Forma Souls, you are able to skip the hassle of building up characters, giving them free stat buffs. Locking features that should be free behind a paywall. Too many similar events that just feel unrewarding, and just generally feels like the only way to play is to pay for the new units that powercreep.",
			"New subscription plan is an overpriced disgusting cash grab that they locked quality of life upgrades behind. It's also hard to avoid because even if you don't want to pay it they throw the option in your face at every opportunity, like 5 orbs you can't collect from the mission screen, but the 'collectable mission' notification never goes away. I used to love this game but it's hard to play it now.",
			"What's this? Feh's 3rd anniversary, time to celebrate...is what i'd like to say. This new $10 a month subscription wasn't needed when locking mechanics behind a frickin paywall. I think this was a bad idea and the pass just isn't worth the money. The pass includes exclusive rewards and quests. The better solution is to make these available for everyone in my opinion. It still retains the core gameplay and mechanics as in free summons, strategy, etc. This game is not what it used to be.",
			"This game is one of the best mobile games. I've been playing it for a while now and have never gotten tired of it. It really challenges you mentally and has endless features. But I would deeply appreciate a mode where you can challenge your friends, so that you can experiment with your teams, while not losing or gaining anything from battling them. Thank you to nintendo for giving me such an enjoyable game on a mobile platform!!!",
			"Game is great, I really enjoy playing it. There are so many characters to choose from and so many events. The combat is strategic and enjoyable. Only issues I have are: 1. Orbs for summoms seem to be in excess when you start, but then quickly turn to nothing if you clear everything, and they offer little ways to obtain orbs outside of purchase otherwise. 2. Alot of the characters are really cool and have neat dialogue. Others they sacrifice all of that for sexual promiscuity.",
			"It basically feels like a fantasy world Pokemon game where you pick your team, teach them skills, level them up, and take on challenges. You can be a collector or work on customizing and optimizing your favorite characters. Also, you can tell the designers value and reward their players, seeking their input on things like characters they want created and ways they can improve things. They are constantly working on new content as well as improving on what they do have. I highly recommend it.",
			"Seriously, I love it. The current build is very accessable for the F2P player, and there is plenty to keep you busy for a few minutes or a whole day. Visuals and Sound are great to. Great difficulty options for relaxed or new players, all the way up to punishingly precise for the most experienced it seems. I've been playing for a couple weeks and I would say it's a good time to be starting or returning.",
			"For the two years I've played this my sayisfaction and sense of achievement have been slowly eroded with each new summoning banner and activity. The inability to obtain the units you want and obtain the power needed to play the new events has become distressing, and every update has made it hopless to even be able to keep up with the new challenges being released. Thank you for the first year and a half, but now this game is a write off.",
			"The Feh Pass is shown way too often, especially with the quests that I can't claim without purchasing the pass. Nobody wants to pay over $100/year for a mobile game, and nobody likes having advertisements for something they don't want pop up in their face all the time. Please keep the Feh Pass hidden in the shop where it belongs, and maybe add the quality of life changes (auto-start, rewind, etc) as features to the base game. I'm okay with the special units and quest rewards being locked behind a pass, but don't shove it in my face by showing me progress updates on quests I can't claim rewards for.",
			"This game is very overwhelming at first. There are so many things going on at once, and if you're new, the you may be instantly turned off by it. There's so much that isn't even explained in the game itself, and in order to complete the harder challenges, outside research is required. The microtransactions are fair, you can buy the item needed to summon new heroes, or specific heroes, but one star removed for the FEH pass. It's 10$ a month and feels essentially to the experience.",
			"Fair warning this game while fair, is for the most part very poorly handled, the recent anniversary catastrophe is the best example of such. If you decide to start playing my advice would be to look up some info beforehand for certain modes, as well as what characters are actually useful otherwise you may find yourself getting frustrated in the harder heavy handed content.",
			"I really liked FEH at first, it was fun and challenging, and I loved the feeling of getting the heroes I wanted. Now, though, it's just a desperate cash grab. With a $10 monthly subscription service and extremely limited amounts of free orbs, the game has lost it's charm. Normally I'd hold onto the app in hopes that it would improve later on, but since the game is a whopping 2.8 gigabytes, and my phone only has 16 for literally everything, I have no choice but to say goodbye to FEH for good.",
			"This game is great, I have many good experiences with it. However, the summoning system needs to be reworked. While playing I have found it to be too costly for both in game currency and actual money. I have also noticed that the appearance rates for certain heroes are next to none while others are really high. Nintendo you make great games, but implore you to fix the summoning system, so that people can get the heroes they want instead of giving up. You have lost a player.",
			"For the anniversary livestream, they announced multiple great quality of life features, updated art and boosted stats for old units that had lagged behind, and methods to skip the low-effort, tedious grinds that happen between the fun parts...and then put all of it into a subscription service that costs an entire $10 a month. You could buy full, complete games on a regular game system for that much. The cost of a year of the subscription is enough to buy almost any pre-owned console you want.",
			"6/26/2020: I've been playing for about three years and during this time I've dropped a few thousand on the game. Despite this, it's incredibly difficult to remain within the upper ranks without continuing to drop larger and larger sums of cash. I tried FEHpass and recently let it run out. Now I see that I was pretty heavily reliant on the auto run feature that really should have been free in the first place. I truly love this game, but all this💰 got me 💔 Previous reviews: (👍)( Still pretty👌)",
			"Was a fan. I've played for a couple years now, and found the game to be a lot of fun. As a FE fan from my elementary years on, this game provides a vast amount of memories and fan service. However, this recent banner was a disaster. Extremely improbable outcomes, pulling heroes with a 0% chance, etc. Several messages to customer support yielded zero responses. Not sure if it's a bug or rigged, but it lost my confidence.",
			"Over all the mechanics are flawless, character design & music is exquisite, and the story is exhilarating. Although the updates take up a lot of space and can slow the performance of not only the game but as well as the device itself which can cause slowness, loss of interest, and corruption of data, in my opinion this must be fixed. I agree with every one in the comments and reviews, the need for a more experience is a must in order to have a better, profitable game.",
			"How the mighty have fallen. This game had a very solid first year, but after a few questionable business and design decisions (New busted skills that made armor units inherently superior to any other type of unit), they decided to double down on their mistakes instead of fixing them. Now this game is plagued by constant powercreep and a complete lack of meaningful new content. They even tried to fix a completely busted arena scoring system by making you pay for units with a suboptimal skill that \"fixes\" the problem (i.e. made it worse). The early content may be fun still, but don't expect to stay around much. There's basically nothing to do once you finish the main content. This game is definitely past its prime, and it's all likely downhill from here.",
			"Gameplay is awesome! However, I'm thoroughly disappointed in the lack of a map overworld. Without it, this game is missing much needed immersion. All you had to do was implement a map, instead of tiles. How bloody hard is that?? Hell, Shadowverse has a map and a great story and they are a CCG, unfortunately. This isn't the Fire Emblem that I know and love. It's nothing more than a cash grab with very little investment in immersion and story.",
			"A lot of fun, but impossible to compete without paying. You can experience everything in this game and beat every mission with proper planning without paying money and without grinding super long. Power creep is dismal but many of the older units get buffs later on. Many of the new units have odd, extremely specific skills, with their weapons often having full paragraph descriptions.",
			"One of, if not, the best games I've played. The character artwork is beautiful, the gameplay is fun, the special events, specifically the rhythm one, are very enjoyable, and although you can burn through a lot of pearls, they give away a huge amount for free by events, login bonuses, and as a reward for beating almost any battle or quest. Perfect game!",
			"I absolutely love Fire Emblem. This game brings all the characters together in a fun way. Unfortunately, after upgrading to Android Pie, this app crashes upon start. I would love to continue playing, but I seem to be unable to. If this was fixed I would give it the five stars it deserves, but I just can't play it right now. Edit: the game now loads up properly. Whether the original problems was Android Pie or something else, it was fixed. Glad to continue playing!",
			"Visually beautiful and highly disappointing. I am a huge fan of Fire Emblem. The biggest flaw is that each battle map is one screen in size. This leads to each battle occurring with no more than 4 characters per team on a map that is approximately seven spaces wide and nine spaces high. Characters can cross the map in three or four turns. This makes it fantastically boring. Another problem is the very large and confusing array of items, upgrades, hero summoning, and settings. Nintendo has made an impressive effort at simplifying the tutorials and user interface. When purchase suggestions or incentives are thrown on top of these already confusing arrays, it throws all their effort away. You will be frustrated attempting to spend any time playing.",
			"Every since I recently downloaded the game again, it always crashes! I loved this game before. Now it's always crashing on me! Maybe it's the new graphic update? If this gets fixed I would definitely play it now. I love the gameplay and graphics though, and the characters have such good artworks.",
			"I've been playing since day 1. While there have been a lot of improvements to the game since it launched, there are also a lot of issues that Intelligent Systems hasn't addressed, despite people sending feedback for years now. This game focuses so much on summoning units you want to the point that it's detrimental. In order to make your favorite as powerful as possible, you have to summon 11 copies of them (maybe even more if you don't get the stat boon you wanted) and then also probably summon other units to use for inheriting skills to them. Furthermore, the pool of summonable units at lower rarities is very bloated, so even summoning specific \"common\" (3-4 star rarity) units for simple skill inheritance can be difficult. Units who were in the game at 5 star rarity at launch are still locked to 5 star rarity despite being vastly inferior to more recent additions. The most egregious issue with this game, however, comes from the recent version 4.2.0 update, released Feb. 2 2020. The Feh Pass monthly subscription is overpriced for what it provides, and it also locks some quality of life features behind a paywall, despite other gachas having these features available for free. That aside, even though it shouldn't be an issue for people who don't want to buy it, the game continually shoves it in your face. Any map that can use the Auto-Start feature (one of the QoL features in the pass) will have a prompt to go buy the pass when you select that map to play it. The summoner support menu has a prompt to go buy the pass so that you can have 3 summoner supported units instead of just 1. To top it all off, the quests menu will show the Feh Pass exclusive quests, your progress toward them, and any rewards from them, even when you don't have the pass. The finished quests indicator will include them among finished ones even though you can't claim the rewards without the pass, so that it will serve as a constant reminder that you're missing out on things by not paying. It's extremely obnoxious, and there is no way to remove it except by buying the pass. (The exclusive quests do expire at certain times of each month, but they're so simple to complete that you'll just complete the next exclusive set if you're actually playing the game.) Tl;dr: summoning is the focus of this game but it's also boring and there's a lot of powercreep. The newest update put quality of life features (among other things) behind a paywall for a price that's too high and then constantly reminds you about how you should buy the Feh Pass.",
			"This game has been on the decline for a long time and there are no signs it's going to improve. The summoning pool is a nightmare with supposedly common 3 and 4 star heroes being as difficult to obtain as a focus 5 star hero because of how bloated it is. The content is stale and repetitive with each new mode playing the same. The second anniversary was a chance for them to show some upcoming improvements but all we got were more random summoning events which shows how much players are respected."
		],
		"containsAds": false,
		"contentRating": "Teen",
		"contentRatingDescription": "Fantasy Violence, Partial Nudity, Suggestive Themes",
		"currency": "USD",
		"description": "Nintendo's hit strategy-RPG Fire Emblem series, which has been going strong for more than 30 years, continues its journey on smart devices.\r\n\r\nFight battles customized for touch screens and on-the-go play. Summon characters from across the Fire Emblem universe. Develop your Heroes' skills, and take them to new heights. This is your adventure—a Fire Emblem that's like nothing you've seen before!\r\n\r\nThis application is free to download and offers some optional in-app purchases.\r\n\r\n■ An epic quest\r\n\r\nThe game features an ongoing, original story where new characters and dozens upon dozens of battle-tested Heroes from across the Fire Emblem universe meet.\r\n\r\nThere are over 2,100 story stages available as of August 2023! (This total includes all difficulty modes.) Clear these story stages and you'll earn Orbs, which are used for summoning Heroes.\r\nNew story chapters are added frequently, so don't miss out!\r\n\r\n■ Intense battles\r\n\r\nTake part in strategic turn-based battles streamlined for on-the-go play with maps that fit in the palm of your hand! You'll need to think hard about the advantages and disadvantages of each Hero's weapon...and even evaluate the map itself as you battle. Lead your army with easy touch-and-drag controls, including the ability to attack by simply swiping an ally over an enemy.\r\n\r\nNew to strategic turn-based battles? Don't worry! Use the Auto-Battle option to have your characters fight on their own.\r\n\r\n■ Strengthen your favorite Heroes\r\n\r\nThere are many ways to strengthen your allies: leveling, skills, weapons, equipable items, and more. Take your characters to greater and greater heights as you battle for victory.\r\n\r\n■ Replayable modes\r\n\r\nIn addition to the main story, there are many other modes where you can strengthen your allies, compete against other players, and more. \r\n\r\n■ Original characters meet legendary Heroes\r\n\r\nThe game features numerous Hero characters from the Fire Emblem series and brand-new characters created by artists Yusuke Kozaki, Shigeki Maeshima, and Yoshiku. Some Heroes will fight at your side as allies, while others may stand in your way as fierce enemies to be defeated and added to your army.\r\n\r\nFeaturing Heroes from the following games in the series!\r\n\r\n・ Fire Emblem: Shadow Dragon & the Blade of Light\r\n・ Fire Emblem: Mystery of the Emblem\r\n・ Fire Emblem: Genealogy of the Holy War\r\n・ Fire Emblem: Thracia 776\r\n・ Fire Emblem: The Binding Blade\r\n・ Fire Emblem: The Blazing Blade\r\n・ Fire Emblem: The Sacred Stones\r\n・ Fire Emblem: Path of Radiance\r\n・ Fire Emblem: Radiant Dawn\r\n・ Fire Emblem: New Mystery of the Emblem\r\n・ Fire Emblem Awakening\r\n・ Fire Emblem Fates: Birthright/Conquest\r\n・ Fire Emblem Echoes: Shadows of Valentia\r\n・ Fire Emblem: Three Houses\r\n・ Tokyo Mirage Sessions ♯FE Encore\r\n・ Fire Emblem Engage\r\n\r\n* Internet connectivity required to play. Data charges may apply.\r\n* You must be at least 13+ to use this game with a Nintendo Account.\r\n* We permit our third-party partners to collect data from this app for analytical and marketing purposes. For more information about our ads, please see the “How we use your information” section of the Nintendo Privacy Policy.\r\n* Variations in individual device specifications and other applications being run on a device may affect normal operation of this application.\r\n* May include advertising.",
		"descriptionHTML": "Nintendo&#39;s hit strategy-RPG Fire Emblem series, which has been going strong for more than 30 years, continues its journey on smart devices.<br><br>Fight battles customized for touch screens and on-the-go play. Summon characters from across the Fire Emblem universe. Develop your Heroes&#39; skills, and take them to new heights. This is your adventure—a Fire Emblem that&#39;s like nothing you&#39;ve seen before!<br><br>This application is free to download and offers some optional in-app purchases.<br><br>■ An epic quest<br><br>The game features an ongoing, original story where new characters and dozens upon dozens of battle-tested Heroes from across the Fire Emblem universe meet.<br><br>There are over 2,100 story stages available as of August 2023! (This total includes all difficulty modes.) Clear these story stages and you&#39;ll earn Orbs, which are used for summoning Heroes.<br>New story chapters are added frequently, so don&#39;t miss out!<br><br>■ Intense battles<br><br>Take part in strategic turn-based battles streamlined for on-the-go play with maps that fit in the palm of your hand! You&#39;ll need to think hard about the advantages and disadvantages of each Hero&#39;s weapon...and even evaluate the map itself as you battle. Lead your army with easy touch-and-drag controls, including the ability to attack by simply swiping an ally over an enemy.<br><br>New to strategic turn-based battles? Don&#39;t worry! Use the Auto-Battle option to have your characters fight on their own.<br><br>■ Strengthen your favorite Heroes<br><br>There are many ways to strengthen your allies: leveling, skills, weapons, equipable items, and more. Take your characters to greater and greater heights as you battle for victory.<br><br>■ Replayable modes<br><br>In addition to the main story, there are many other modes where you can strengthen your allies, compete against other players, and more. <br><br>■ Original characters meet legendary Heroes<br><br>The game features numerous Hero characters from the Fire Emblem series and brand-new characters created by artists Yusuke Kozaki, Shigeki Maeshima, and Yoshiku. Some Heroes will fight at your side as allies, while others may stand in your way as fierce enemies to be defeated and added to your army.<br><br>Featuring Heroes from the following games in the series!<br><br>・ Fire Emblem: Shadow Dragon &amp; the Blade of Light<br>・ Fire Emblem: Mystery of the Emblem<br>・ Fire Emblem: Genealogy of the Holy War<br>・ Fire Emblem: Thracia 776<br>・ Fire Emblem: The Binding Blade<br>・ Fire Emblem: The Blazing Blade<br>・ Fire Emblem: The Sacred Stones<br>・ Fire Emblem: Path of Radiance<br>・ Fire Emblem: Radiant Dawn<br>・ Fire Emblem: New Mystery of the Emblem<br>・ Fire Emblem Awakening<br>・ Fire Emblem Fates: Birthright/Conquest<br>・ Fire Emblem Echoes: Shadows of Valentia<br>・ Fire Emblem: Three Houses<br>・ Tokyo Mirage Sessions ♯FE Encore<br>・ Fire Emblem Engage<br><br>* Internet connectivity required to play. Data charges may apply.<br>* You must be at least 13+ to use this game with a Nintendo Account.<br>* We permit our third-party partners to collect data from this app for analytical and marketing purposes. For more information about our ads, please see the “How we use your information” section of the Nintendo Privacy Policy.<br>* Variations in individual device specifications and other applications being run on a device may affect normal operation of this application.<br>* May include advertising.",
		"developer": "Nintendo Co., Ltd.",
		"developerAddress": "京都府京都市南区上鳥羽鉾立町11-1",
		"developerEmail": "fire-emblem-heroes-support@nintendo.co.jp",
		"developerId": "7277267556905944956",
		"developerWebsite": "https://fire-emblem-heroes.com/",
		"free": true,
		"genre": "Simulation",
		"genreId": "GAME_SIMULATION",
		"headerImage": "https://play-lh.googleusercontent.com/CE3m3k1ZJbzsnSIEx02Xy63zNY5bV0PrL_lFzRkoBbe8b3DLQDYaewQa7rD_qKTiVA",
		"histogram": [
			33689,
			12474,
			30194,
			84653,
			452278
		],
		"icon": "https://play-lh.googleusercontent.com/x0KXDvnLHNcgUbA2Pwe2Id8YBNC97WM-057Qg-b-6kSbrd2ymBwC37R9cg081QY5ymQ",
		"inAppProductPrice": "$1.99 - $74.99 per item",
		"installs": "5,000,000+",
		"minInstalls": 5000000,
		"offersIAP": true,
		"originalPrice": null,
		"price": 0,
		"privacyPolicy": "https://fire-emblem-heroes.com/app_privacy_policy/",
		"ratings": 613298,
		"realInstalls": 9215485,
		"released": "Feb 2, 2017",
		"reviews": 71714,
		"sale": false,
		"saleText": null,
		"saleTime": null,
		"score": 4.482732,
		"screenshots": [
			"https://play-lh.googleusercontent.com/4ybE_xGXoDPwTmpk4Y9BtYlxBkjBQ2RJAhc3sIbfhaZseIggJCDozswjLAX-sT7QGGIY",
			"https://play-lh.googleusercontent.com/Aqynp2fzlswsAR26ePHbMT61TD9Undb2YIM3DplbkE13jVqVZR_8cAuTzSH3HV1dbyg",
			"https://play-lh.googleusercontent.com/cWCxhuIgJM3f-bLTQUhR-mub3dHzrvjODmLpwlzIqKoyYLXaxG68hcRhZD6tvnEvcrI",
			"https://play-lh.googleusercontent.com/_KOm45mWhSwHaFLMLsodmWsX6P4FVOc-InZgEwqSRE_IWfIawC24i5Z_9LHhK4xdgoA",
			"https://play-lh.googleusercontent.com/LezhPMUcK6mFvesBVGMJJvo8Byz3GNvVfwCElXtN0OFdD9_c6a9_PDuXh6pJa_x94HKw",
			"https://play-lh.googleusercontent.com/tOKNWA8pByGCwyevdEZdEroRFHF0BFxbetUZ2IjSSsVz15C3B1EWx3ENN03lo45TKA",
			"https://play-lh.googleusercontent.com/VSJyl7kPNea93UbtoG6Ld3aOBvS7plXHB0R2YQWa_NB-gHYVvKZLLydzna3usqRVzg",
			"https://play-lh.googleusercontent.com/FWteyrNZRs9oljCxGzu1jKh1yW6UVvh3Bs-zpEVcJlQejvloO-_DAXO_cpuRYxI4A7Y",
			"https://play-lh.googleusercontent.com/NjwDay8T4V58xn1Mpl56RfdiYduj_Q8Oj9osCb3N7ozjmrGdliiBkI4Z3nG9VTY3Yms",
			"https://play-lh.googleusercontent.com/nJ7uXjLonQOtbF7-87t2waxZMN4YTqH0cBkUQPBtacvPgYg-XvG-BlvG2RIUuj2JLn3i",
			"https://play-lh.googleusercontent.com/mLlJlQzUxNZ-6evLeU5_y2ANgj5jnKhItQ423i-cx0bSA0m5GGWGItUWolnoVKzzKQ",
			"https://play-lh.googleusercontent.com/wEhYlx9_N92NZfQfQbrMkbm0W2JQaFGoMDhEA2yzA0ERALkyosHSMs1clbD8SHe4OFQ",
			"https://play-lh.googleusercontent.com/5Y7Ja7Kja4TZ_P7512GLwb7ErMckFK-HyZPQ3p52rSHyKTMLJyEofu9rEdd_IoNDpXk",
			"https://play-lh.googleusercontent.com/1BvmJZ0lI6zXP-2Mj8v36PqbP4A24LcbO4hDy0_Gm0w4GfcHSzjEIwWV0xiwfEIfh3Y",
			"https://play-lh.googleusercontent.com/PKzhJVSGhhSqE0WX-UG1YjHKmDU8YzyZelSEjQb7hWAfYqoB2KRKTQX8DXCgkgZlJtc",
			"https://play-lh.googleusercontent.com/XpWjvJFY3zZIW89DJJuZBlFAOMrt9YkpHJAQvZ1J1s-S0q0kSjWUGGXrSQ0tS93dH1NK",
			"https://play-lh.googleusercontent.com/eopSaURUjFjK-ppk3TLd_B8u0WY2Tg2e00ED5eui0wceYVeSSxBkApdD-n0nNAK0tWgP",
			"https://play-lh.googleusercontent.com/dbQwQidavl-INdLhRUvjjz2H9ElQVy3omTi257kc2tD4siuO7U86GEXxak2RIwSRRK2k",
			"https://play-lh.googleusercontent.com/oiA6KXhv9sY7I-FHQSRfw6n7YdDV4vvWFgQH0Zt74wKNqlyNCgOX5bCgu0Wdoaq_tIc",
			"https://play-lh.googleusercontent.com/WyCWhGz5NrLb4uK-PI1r9lcPSBZ6aySpKdw1jQ0lZYUPihcr6V6FxN57olYwlxzkI-bm",
			"https://play-lh.googleusercontent.com/4dX3Aa8wolYtvWPSPaRpzlbhiBRwxJm5S9Zif7EMrlDTPuNr3UItTiPsHA5X8YOPV28",
			"https://play-lh.googleusercontent.com/LydlcMD8IIlYa_XZNBGnfOjdBXEUyp2OsHKJZo0bp9Q-hy8EP7J0co3rGEL7VqZbNx0",
			"https://play-lh.googleusercontent.com/rLWA7sDukeqVKPMYQl61PbtOeecpczcOnxJXyXMoECQ13kvqgX3jTf-A2VG-0QO_kZM",
			"https://play-lh.googleusercontent.com/Df1IhAiqxXuLJLZhNXQw0UcCcCMOd5YVn0Edpf4pevRdmX5pfBUssl5t3yyuoVsU5RIR"
		],
		"summary": "[Book VII Begins] The battle across time has arrived!",
		"title": "Fire Emblem Heroes",
		"updated": 1695884079,
		"url": "https://play.google.com/store/apps/details?id=com.nintendo.zaba&hl=en&gl=us",
		"version": "7.10.0",
		"video": "https://www.youtube.com/embed/aHFjMCIKq1U?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
		"videoImage": "https://play-lh.googleusercontent.com/CE3m3k1ZJbzsnSIEx02Xy63zNY5bV0PrL_lFzRkoBbe8b3DLQDYaewQa7rD_qKTiVA"
	}
}